//SPDX-License-Identifier: MIT
pragma solidity ^0.8.0;
import "ERC20.sol";

// https://똥코인.com
// https://twitter.com/poocoineth

/*
                     ⢀⣀⣤⣤                  
                  ⢀⣴⡾⠟⠋⢩⣿                  
                ⣠⣾⠟⠁   ⠸⣷⡀                 
              ⢀⣴⠟⠁      ⠙⣷⡄                
             ⢀⣾⠋         ⠘⣿                
             ⣾⠃     ⠐⠷⠤⠤⠤⠤⣿⣤⣀              
            ⢸⣿             ⠈⠛⢿⣦⡀           
         ⢀⣤⡾⠟⠛⢦⣄              ⠙⣷⡀          
        ⢰⡿⠉    ⠈⠓⠦⣄            ⢸⡇          
        ⣿  ⣀⡤⠤⠤⢄⡀ ⠈⠙⠒⠦⣤⣀⣠⠖⠋⠉⠓⠦⣀⣸⡇          
       ⣀⣿⣧⡞⠁⢀⣀⡀ ⠙⣆     ⡼⠁ ⣠⣤⡀ ⠙⡟⠿⢶⣤⡀       
     ⣠⡾⠟⠁⡼ ⢠⣿⣿⣿⣦ ⠘⡆   ⢰⠇ ⣼⣿⣿⣿⡄ ⢹  ⠙⢿⣄      
    ⣼⡟   ⡇ ⢸⣿⣿⣿⣿⠆ ⡧   ⠸⡆ ⣿⣿⣿⣿⡇ ⢸⠇  ⠈⣿⡀     
    ⣿    ⢻⡀⠘⣿⣿⣿⡿ ⢀⠟⠦⢤⣀⡀⢳ ⠘⢿⣿⠟  ⡼    ⣿⠇     
    ⢿⡆    ⢳⡀⠈⠉⠉ ⢀⡞   ⠈⠉⠙⠳⣄   ⣠⣾⣁⣀⣀⣀⣠⣿⣤⣀    
   ⣀⣼⣿⡄    ⠙⠲⠤⠤⠒⠉        ⠈⠉⡉⡉⠁       ⠉⠛⢷⣦  
 ⣠⣾⠟⠉ ⠙⢦⡀    ⣴⠒⠒⠲⠤⠤⠤⠴⠖⠒⠒⠒⠊⠉⢉⡿           ⠹⣷ 
⢰⡟⠁     ⠉⠳⢤⣀ ⠈⠳⣄         ⢀⡴⠋             ⢿⡇
⣿⠁         ⠉⠛⠲⢤⣀⡙⠲⠤⠤⣤⣤⠤⠴⠚⠉               ⣾⡇
⢻⣧              ⠉⠙⠓⠲⠤⢤⣄⣀⣀               ⣰⡿ 
 ⠙⢷⣤⣀               ⢀⣀⣀⣠⣭⣽⣿⠶⠶⠶⣶⣤⣤⣤⣤⣤⣤⣤⣶⠿⠛  
   ⢉⣙⡛⠿⠷⠶⢶⣶⣶⣶⡶⠶⠶⠾⠿⠟⠛⠛⠋⠉⠉⠁        ⠈⠉⠉⠉⠁     
*/

// 도권입니다. 나는 몬테네그로 감옥에 있는데 엉덩이 구멍에 몰래 넣은 핸드폰으로 이것을 배포하고 있습니다. 도와주세요.

contract Token is ERC20 {
    constructor(
        uint256 _initialSupply
    ) ERC20(unicode"똥코인", unicode"똥코인") {
        _mint(msg.sender, _initialSupply);
    }
}
